{
  "title": "About the analysis",
  "description": "This page provides general information about the types of analyses performed on the audio and musical corpuses.",
  "sections": {
    "musicxml": {
      "heading": "MusicXML analysis",
      "text": "MusicXML files are analyzed using the music21 computational musicology toolkit. Extracted features include key (through tonal analysis), time signature, and tempo indications. Additional outputs include ambitus (the pitch range of the work), duration expressed in measures and beats, and melodic contour sequences, representing the relative directional movement of adjacent pitches (ascending, descending, or repeated)."
    },
    "rhythm": {
      "heading": "Rhythm and pitch n-grams",
      "text": "Rhythm and pitch interval analyses are performed using n-gram models, where successive durational values or intervallic steps are encoded as sequences. Frequencies of these sequences are aggregated into histograms to provide distributions of observed rhythmic and melodic interval patterns. Only those n-grams that occur more than once are retained, with separate results produced for rhythm and pitch."
    },
    "audio": {
      "heading": "Audio analysis",
      "text": "Audio recordings are processed with digital signal processing methods. Extracted features include tempo estimation in beats per minute, pitch contours from separated vocal and instrumental stems, chord progressions with temporal boundaries, and RMS loudness curves (for full mix, vocals, and accompaniment) with associated time resolution. Additionally, key estimation produces the tonic, mode (major/minor), and confidence value based on spectral and tonal features."
    },
    "metadata": {
      "heading": "Metadata",
      "text": "Metadata is obtained from multiple sources, including MusicXML header data and supplementary corpus-specific CSV files. The extracted fields include bibliographic information (title, composer, dates, edition details), licensing information, and descriptive tags present in the data. Each metadata record is associated with its corresponding file name, enabling consistent indexing alongside analytical features."
    }
  }
}
